AFN1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
    }
    AortaInlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate tableFile;
        volumetricFlowRateCoeffs
        {
            file            "/cluster/work/helenhoe/IDUN/AFN1vol3dTint/DataFiles/aortaInlet";
        }
        value           uniform (-0 0 -0);
    }
    REI
    {
        type            zeroGradient;
    }
    LEI
    {
        type            zeroGradient;
    }
    LII
    {
        type            zeroGradient;
    }
    RII
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
