AFN1/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    walls
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    AortaInlet
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    REI
    {
        type            zeroGradient;
    }
    LEI
    {
        type            zeroGradient;
    }
    LII
    {
        type            zeroGradient;
    }
    RII
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
