AFN1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          1e-04;

writeControl    timeStep;

maxCo		1.5;

//adjustTimeStep  yes;

maxDeltaT	1e-03;

writeInterval   200;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{

wallShearStress1

{

    // Mandatory entries (unmodifiable)

    type            wallShearStress;

    libs            (fieldFunctionObjects);



    // Optional entries (runtime modifiable)

    patches         (walls); // (wall1 "(wall2|wall3)");



    // Optional (inherited) entries

    writePrecision  8;

    writeToFile     true;

    useUserTime     true;

   // region          region0;

    enabled         true;

    log             true;

    //timeStart       0;

    //timeEnd         1000;

    executeControl  timeStep;

    executeInterval 1;

    writeControl    timeStep;

    writeInterval   200;
}


/*
    #include "streamLines"
    #include "wallBoundedStreamLines"
    #include "cuttingPlane"
    #include "forceCoeffs"
    #include "ensightWrite"
*/
}


// ************************************************************************* //
