AFN1/system/fvSchemes_strict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 0.5;
}

gradSchemes
{
    default         cellMDLimited Gauss linear 0.5;
    grad(U)	    cellMDLimited Gauss linear 0.5;
}

divSchemes
{
    default         Gauss linear;

    div(phi,U)	    Gauss linearUpwind grad(U);
    div(phi,omega)  Gauss linearUpwind default;
    div(phi,k)	    Gauss linearUpwind default;
    div(phi,U)	    Gauss linearUpwind grad(U);

    div((nuEff*dev(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.777;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.777;
}

fluxRequired
{
    default         no;
    p               ;
}


// ************************************************************************* //
