AFN1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           	GAMG;
	tolerance	 	1e-04;
	relTol		 	0.01;
        smoother         	GaussSeidel; 
        nPreSweeps       	0;
        nPostSweeps      	2;
        cacheAgglomeration      on;
	agglomeration		faceAreaPair;
	nCellsInCoarsestLevel	1000;
	mergeLevels		1;

    }

    pFinal
    {
        solver           	GAMG;
	tolerance	 	1e-06;
	relTol		 	0.0;
        smoother         	GaussSeidel; 
        nPreSweeps       	0;
        nPostSweeps      	2;
        cacheAgglomeration      on;
	agglomeration		faceAreaPair;
	nCellsInCoarsestLevel	1000;
	mergeLevels		1;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;

    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 2;
    nCorrectors         3;
    nOuterCorrectors         2;

}

relaxationFactors
{
    p       0.3;
    U       0.5;
}


// ************************************************************************* //
